In [1]:
# install pandas 
%pip install pandas

Requirement already satisfied: pandas in c:\users\comp\appdata\local\programs\python\python314\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\comp\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\comp\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\comp\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\comp\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\comp\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

print(pd.__version__)

2.3.3

In [3]:
data = ["apple","orange","banana","kivi"]
s = pd.Series(data)
print(s)

0     apple
1    orange
2    banana
3      kivi
dtype: object

In [4]:
# access data from index

print(data[3])

kivi

In [5]:
indexx = ['a','b','c','d']
s = pd.Series(data,index=indexx)
print(s)

a     apple
b    orange
c    banana
d      kivi
dtype: object

In [6]:
# pd.DataFrame

students = {
    "name":['joy','Nishant','ronak','tiya','riya'],
    "age":[23,45,67,12,22],
    "city":['mumbai','pune','jaipur','bhuj','surat']
}

df = pd.DataFrame(students)
print(df)

# change index 

indexx = [101,102,103,104,105]

df = pd.DataFrame(students,index=indexx)
print(df)

df.to_csv('student.csv',index=False)

      name  age    city
0      joy   23  mumbai
1  Nishant   45    pune
2    ronak   67  jaipur
3     tiya   12    bhuj
4     riya   22   surat
        name  age    city
101      joy   23  mumbai
102  Nishant   45    pune
103    ronak   67  jaipur
104     tiya   12    bhuj
105     riya   22   surat

In [7]:
# read CSV file

data = pd.read_csv("data.csv")
# top 5 record (row)
print(data.head(5))

  Customer ID Customer Name   Segment           City    Sales  Quantity  \
0    AA-10315    Alex Avila  Consumer    Minneapolis  362.940         3
1    AA-10315    Alex Avila  Consumer  San Francisco   52.980         2
2    AA-10315    Alex Avila  Consumer  San Francisco  673.568         2
3    AA-10315    Alex Avila  Consumer    Minneapolis   11.540         2
4    AA-10315    Alex Avila  Consumer  San Francisco   26.960         2

     Profit
0   90.7350
1   14.8344
2  252.5880
3    5.7700
4    7.0096

# basic Inspection
- head() -> First 5 row
- tail() -> last 5 row
- info() -> Datatype , and non null counts
- describe() -> Statistical Summary
- shape -> column and row
- index -> row indices 
# Selecting data 
- columns
- row by index 
- row by label
- conditional selection

In [9]:
# head() -> First 5 row
print(data.head(7))

  Customer ID Customer Name   Segment           City     Sales  Quantity  \
0    AA-10315    Alex Avila  Consumer    Minneapolis   362.940         3
1    AA-10315    Alex Avila  Consumer  San Francisco    52.980         2
2    AA-10315    Alex Avila  Consumer  San Francisco   673.568         2
3    AA-10315    Alex Avila  Consumer    Minneapolis    11.540         2
4    AA-10315    Alex Avila  Consumer  San Francisco    26.960         2
5    AA-10315    Alex Avila  Consumer     Round Rock  3930.072         3
6    AA-10315    Alex Avila  Consumer     Round Rock     2.304         1

     Profit
0   90.7350
1   14.8344
2  252.5880
3    5.7700
4    7.0096
5 -786.0144
6    0.7776

In [10]:
# tail() -> last 5 row
data.tail()

,Customer ID,Customer Name,Segment,City,Sales,Quantity,Profit
9989,ZD-21925,Zuschuss Donatelli,Consumer,San Francisco,22.720,4,7.3840
9990,ZD-21925,Zuschuss Donatelli,Consumer,Jacksonville,15.984,2,4.9950
9991,ZD-21925,Zuschuss Donatelli,Consumer,Richmond,259.960,4,124.7808
9992,ZD-21925,Zuschuss Donatelli,Consumer,Richmond,71.120,4,22.0472
9993,ZD-21925,Zuschuss Donatelli,Consumer,Los Angeles,61.440,3,16.5888

In [12]:
# info() -> Datatype , and non null counts
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    9994 non-null   object
 1   Customer Name  9994 non-null   object
 2   Segment        9994 non-null   object
 3   City           9994 non-null   object
 4   Sales          9994 non-null   float64
 5   Quantity       9994 non-null   int64
 6   Profit         9994 non-null   float64
dtypes: float64(2), int64(1), object(4)
memory usage: 546.7+ KB

In [13]:
# describe() -> Statistical Summary
data.describe()

              Sales     Quantity       Profit
count   9994.000000  9994.000000  9994.000000
mean     229.858001     3.789574    28.656896
std      623.245101     2.225110   234.260108
min        0.444000     1.000000 -6599.978000
25%       17.280000     2.000000     1.728750
50%       54.490000     3.000000     8.666500
75%      209.940000     5.000000    29.364000
max    22638.480000    14.000000  8399.976000

In [ ]:
# shape -> column and row
data.shape # (9994, 7) (column,row)

(9994, 7)

In [16]:
# index -> row indices 
data.index

RangeIndex(start=0, stop=9994, step=1)

# Selecting data 
1. columns
2. row by index 
3. row by label
4. conditional selection

In [21]:
print(data.columns)

# select only customer name column 
print(data['Customer Name'].head())

# multiple column
print(data[['Customer Name','Sales']].head())

Index(['Customer ID', 'Customer Name', 'Segment', 'City', 'Sales', 'Quantity',
       'Profit'],
      dtype='object')
0    Alex Avila
1    Alex Avila
2    Alex Avila
3    Alex Avila
4    Alex Avila
Name: Customer Name, dtype: object
  Customer Name    Sales
0    Alex Avila  362.940
1    Alex Avila   52.980
2    Alex Avila  673.568
3    Alex Avila   11.540
4    Alex Avila   26.960

In [23]:
# row by index 
data.iloc[0]

Customer ID         AA-10315
Customer Name     Alex Avila
Segment             Consumer
City             Minneapolis
Sales                 362.94
Quantity                   3
Profit                90.735
Name: 0, dtype: object

In [24]:
# row by index 10 to 20
data.iloc[10:20]

,Customer ID,Customer Name,Segment,City,Sales,Quantity,Profit
10,AA-10315,Alex Avila,Consumer,New York City,14.560,2,6.2608
11,AA-10375,Allen Armold,Consumer,Providence,16.900,5,7.7740
12,AA-10375,Allen Armold,Consumer,Providence,39.960,2,18.7812
13,AA-10375,Allen Armold,Consumer,Los Angeles,16.520,5,5.5755
14,AA-10375,Allen Armold,Consumer,Atlanta,8.260,2,3.8822
15,AA-10375,Allen Armold,Consumer,Atlanta,499.980,2,114.9954
16,AA-10375,Allen Armold,Consumer,Salem,5.248,2,0.5904
17,AA-10375,Allen Armold,Consumer,Omaha,28.400,2,11.0760
18,AA-10375,Allen Armold,Consumer,Omaha,149.970,3,50.9898
19,AA-10375,Allen Armold,Consumer,Rancho Cucamonga,34.272,3,11.1384

In [27]:
# column by position 
data.iloc[:, 3]

0         Minneapolis
1       San Francisco
2       San Francisco
3         Minneapolis
4       San Francisco
            ...
9989    San Francisco
9990     Jacksonville
9991         Richmond
9992         Richmond
9993      Los Angeles
Name: City, Length: 9994, dtype: object

In [29]:
# conditional Selection 
data[data['Sales']>10000]

,Customer ID,Customer Name,Segment,City,Sales,Quantity,Profit
4023,HL-15040,Hunter Lopez,Consumer,Newark,10499.970,3,5039.9856
7780,RB-19360,Raymond Buch,Consumer,Seattle,13999.960,4,6719.9808
8789,SM-20320,Sean Miller,Home Office,Jacksonville,22638.480,6,-1811.0784
9216,TA-21385,Tom Ashbrook,Home Office,New York City,11199.968,4,3919.9888
9367,TC-20980,Tamara Chand,Corporate,Lafayette,17499.950,5,8399.9760

In [32]:
# example 
data[(data['Sales'] > 1000) & (data['City'] == "Newark")]

,Customer ID,Customer Name,Segment,City,Sales,Quantity,Profit
4023,HL-15040,Hunter Lopez,Consumer,Newark,10499.970,3,5039.9856
6985,NF-18385,Natalie Fritzler,Consumer,Newark,1799.994,2,-2639.9912
6986,NF-18385,Natalie Fritzler,Consumer,Newark,2025.360,6,607.6080
9934,YC-21895,Yoseph Carroll,Corporate,Newark,2934.330,7,792.2691

In [34]:
data[data['City'] == "Newark"]

,Customer ID,Customer Name,Segment,City,Sales,Quantity,Profit
898,BD-11725,Bruce Degenhardt,Consumer,Newark,46.720,5,17.5200
1063,BH-11710,Brosina Hoffman,Consumer,Newark,166.440,3,79.8912
1064,BH-11710,Brosina Hoffman,Consumer,Newark,479.950,5,129.5865
1069,BH-11710,Brosina Hoffman,Consumer,Newark,447.860,7,219.4514
1389,BT-11680,Brian Thompson,Consumer,Newark,4.656,2,1.5714
...,...,...,...,...,...,...,...
9811,VM-21835,Vivian Mathis,Consumer,Newark,32.540,2,15.9446
9934,YC-21895,Yoseph Carroll,Corporate,Newark,2934.330,7,792.2691
9936,YC-21895,Yoseph Carroll,Corporate,Newark,57.750,5,26.5650
9938,YC-21895,Yoseph Carroll,Corporate,Newark,124.410,3,14.9292
9952,YS-21880,Yana Sorensen,Corporate,Newark,465.180,3,120.9468